CSI API ETABS v1
cPropFrame.GetGeneral_1 Method
 Retrieves frame section property data for a general frame section
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetGeneral_1(
	string Name,
	ref string FileName,
	ref string MatProp,
	ref double T3,
	ref double T2,
	ref double Area,
	ref double As2,
	ref double As3,
	ref double Torsion,
	ref double I22,
	ref double I33,
	ref double I23,
	ref double S22,
	ref double S33,
	ref double Z22,
	ref double Z33,
	ref double R22,
	ref double R33,
	ref double EccV2,
	ref double EccV3,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetGeneral_1 (
	Name As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef T3 As Double,
	ByRef T2 As Double,
	ByRef Area As Double,
	ByRef As2 As Double,
	ByRef As3 As Double,
	ByRef Torsion As Double,
	ByRef I22 As Double,
	ByRef I33 As Double,
	ByRef I23 As Double,
	ByRef S22 As Double,
	ByRef S33 As Double,
	ByRef Z22 As Double,
	ByRef Z33 As Double,
	ByRef R22 As Double,
	ByRef R33 As Double,
	ByRef EccV2 As Double,
	ByRef EccV3 As Double,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim FileName As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Area As Double
Dim As2 As Double
Dim As3 As Double
Dim Torsion As Double
Dim I22 As Double
Dim I33 As Double
Dim I23 As Double
Dim S22 As Double
Dim S33 As Double
Dim Z22 As Double
Dim Z33 As Double
Dim R22 As Double
Dim R33 As Double
Dim EccV2 As Double
Dim EccV3 As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetGeneral_1(Name,
	FileName, MatProp, T3, T2, Area, As2,
	As3, Torsion, I22, I33, I23, S22, S33,
	Z22, Z33, R22, R33, EccV2, EccV3, Color,
	Notes, GUID)
int GetGeneral_1(
	String^ Name,
	String^% FileName,
	String^% MatProp,
	double% T3,
	double% T2,
	double% Area,
	double% As2,
	double% As3,
	double% Torsion,
	double% I22,
	double% I33,
	double% I23,
	double% S22,
	double% S33,
	double% Z22,
	double% Z33,
	double% R22,
	double% R33,
	double% EccV2,
	double% EccV3,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetGeneral_1 :
        Name : string *
        FileName : string byref *
        MatProp : string byref *
        T3 : float byref *
        T2 : float byref *
        Area : float byref *
        As2 : float byref *
        As3 : float byref *
        Torsion : float byref *
        I22 : float byref *
        I33 : float byref *
        I23 : float byref *
        S22 : float byref *
        S33 : float byref *
        Z22 : float byref *
        Z33 : float byref *
        R22 : float byref *
        R33 : float byref *
        EccV2 : float byref *
        EccV3 : float byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing frame section property.
FileName
Type: System.String
If the section property was imported from a property file, this is the name of that file. If the section property was not imported, this item is blank.
MatProp
Type: System.String
The name of the material property for the section.
T3
Type: System.Double
The section depth. [L]
T2
Type: System.Double
The section width. [L]
Area
Type: System.Double
The cross-sectional area. [L2]
As2
Type: System.Double
The shear area for forces in the section local 2-axis direction. [L2]
As3
Type: System.Double
The shear area for forces in the section local 3-axis direction. [L2]
Torsion
Type: System.Double
The torsional constant. [L4]
I22
Type: System.Double
The moment of inertia for bending about the local 2 axis. [L4]
I33
Type: System.Double
The moment of inertia for bending about the local 3 axis. [L4]
I23
Type: System.Double
The product of moment of inertia for bending. [L4]
S22
Type: System.Double
The section modulus for bending about the local 2 axis. [L3]
S33
Type: System.Double
The section modulus for bending about the local 3 axis. [L3]
Z22
Type: System.Double
The plastic modulus for bending about the local 2 axis. [L3]
Z33
Type: System.Double
The plastic modulus for bending about the local 3 axis. [L3]
R22
Type: System.Double
The radius of gyration about the local 2 axis. [L]
R33
Type: System.Double
The radius of gyration about the local 3 axis. [L]
EccV2
Type: System.Double
The eccentricity of the shear center for major shear (V2), measured in the local-3 direction from the centroid of the frame section to the shear center. [L]
EccV3
Type: System.Double
The eccentricity of the shear center for minor shear (V3), measured in the local-2 direction from the centroid of the frame section to the shear center. [L]
Color
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes
Type: System.String
The notes, if any, assigned to the section.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the section.
Return Value
Type: Int32
Returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim FileName As String
       Dim MatProp As String
       Dim t3 As Double
       Dim t2 As Double
       Dim Area As Double
       Dim as2 As Double
       Dim as3 As Double
       Dim Torsion As Double
       Dim I22 As Double
       Dim I33 As Double
       Dim I23 As Double
       Dim S22 As Double
       Dim S33 As Double
       Dim Z22 As Double
       Dim Z33 As Double
       Dim R22 As Double
       Dim R33 As Double
       Dim EccV2 As Double
       Dim EccV3 As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetGeneral_1("GEN1", "A992Fy50", 24, 14, 100, 80, 80, 4, 1000, 2400, 3000, 140, 200, 150, 220, 3, 5, 0, 0, -1, "API example", "Default")
   'get frame section property data
       ret = SapModel.PropFrame.GetGeneral_1("GEN1", FileName, MatProp, t3, t2, Area, As2, As3, Torsion, I22, I33, I23, S22, S33, Z22, Z33, R22, R33, EccV2, EccV3, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace